{"id": "jd_001", "source_url": "https://lemon.io/remote-job-descriptions/data-scientist/", "role_title": "Data Scientist", "jd_text": "Building analytical projects to solve business problems and improve customer experiences. Developing and implementing data science, AI and machine‑learning models using tools such as Python, R, NumPy, Pandas, Scikit‑learn and SQL/NoSQL databases. Managing data mining procedures and preparing datasets for modelling. Designing, creating and maintaining data pipelines. Creating data visualizations with Tableau, Qlikview, Matplotlib, Seaborn or Plotly. Working with cloud platforms like AWS, Azure or Google Cloud. Communicating findings to stakeholders and collaborating with product and engineering teams.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Python", "evidence": "Developing and implementing data science, AI and machine‑learning models using tools such as Python"}, {"skill": "R", "evidence": "Developing and implementing data science, AI and machine‑learning models using tools such as Python, R"}, {"skill": "NumPy", "evidence": "using tools such as Python, R, NumPy, Pandas, Scikit‑learn"}, {"skill": "Pandas", "evidence": "using tools such as Python, R, NumPy, Pandas, Scikit‑learn"}, {"skill": "Scikit-learn", "evidence": "using tools such as Python, R, NumPy, Pandas, Scikit‑learn"}, {"skill": "SQL", "evidence": "SQL"}, {"skill": "Tableau", "evidence": "Creating data visualizations with Tableau, Qlikview, Matplotlib, Seaborn or Plotly"}, {"skill": "AWS", "evidence": "Working with cloud platforms like AWS, Azure or Google Cloud"}, {"skill": "Azure", "evidence": "Working with cloud platforms like AWS, Azure or Google Cloud"}, {"skill": "Google Cloud", "evidence": "Working with cloud platforms like AWS, Azure or Google Cloud"}], "notes": ""}
{"id": "jd_002", "source_url": "https://lemon.io/remote-job-descriptions/machine-learning-engineer/", "role_title": "Machine Learning Engineer", "jd_text": "Designing and developing machine‑learning systems and schemas. Implementing ML algorithms in Python using frameworks like PyTorch and TensorFlow. Examining the quality of datasets and performing feature engineering. Building prototypes and setting up infrastructure for testing models. Conducting statistical analysis and using SQL for data extraction. Working with big‑data frameworks such as Hadoop or Spark. Using version control systems like Git and deploying solutions on cloud platforms such as AWS, Google Cloud or Azure. Collaborating with engineering teams and reviewing code.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Python", "evidence": "Implementing ML algorithms in Python using frameworks like PyTorch and TensorFlow"}, {"skill": "PyTorch", "evidence": "Implementing ML algorithms in Python using frameworks like PyTorch"}, {"skill": "TensorFlow", "evidence": "Implementing ML algorithms in Python using frameworks like PyTorch and TensorFlow"}, {"skill": "SQL", "evidence": "using SQL for data extraction"}, {"skill": "Hadoop", "evidence": "Working with big‑data frameworks such as Hadoop or Spark"}, {"skill": "Spark", "evidence": "Working with big‑data frameworks such as Hadoop or Spark"}, {"skill": "Git", "evidence": "Using version control systems like Git"}, {"skill": "AWS", "evidence": "deploying solutions on cloud platforms such as AWS, Google Cloud or Azure"}, {"skill": "Google Cloud", "evidence": "deploying solutions on cloud platforms such as AWS, Google Cloud or Azure"}, {"skill": "Azure", "evidence": "deploying solutions on cloud platforms such as AWS, Google Cloud or Azure"}], "notes": ""}
{"id": "jd_003", "source_url": "https://lemon.io/remote-job-descriptions/devops-engineer/", "role_title": "DevOps Engineer", "jd_text": "Automating deployment processes and managing CI/CD pipelines. Monitoring system performance and responding to infrastructure incidents. Writing scripts in Python and Bash and using tools like Terraform and Ansible to implement infrastructure as code. Managing containerization with Docker and orchestrating containers using Kubernetes. Working with cloud services such as AWS, Google Cloud and Azure. Ensuring security and compliance, troubleshooting systems and resolving incidents. Collaborating with development teams and participating in Agile workflows.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Python", "evidence": "Writing scripts in Python and Bash"}, {"skill": "Bash", "evidence": "Writing scripts in Python and Bash"}, {"skill": "Terraform", "evidence": "using tools like Terraform and Ansible to implement infrastructure as code"}, {"skill": "Ansible", "evidence": "using tools like Terraform and Ansible to implement infrastructure as code"}, {"skill": "Docker", "evidence": "Managing containerization with Docker"}, {"skill": "Kubernetes", "evidence": "orchestrating containers using Kubernetes"}, {"skill": "AWS", "evidence": "Working with cloud services such as AWS, Google Cloud and Azure"}, {"skill": "Google Cloud", "evidence": "Working with cloud services such as AWS, Google Cloud and Azure"}, {"skill": "Azure", "evidence": "Working with cloud services such as AWS, Google Cloud and Azure"}], "notes": ""}
{"id": "jd_004", "source_url": "https://lemon.io/remote-job-descriptions/cloud-engineer/", "role_title": "Cloud Engineer", "jd_text": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud. Optimizing infrastructure for performance, security and cost. Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning. Writing scripts in Python, Go or Bash and implementing Infrastructure as Code. Monitoring infrastructure and integrating third‑party services. Ensuring security best practices and participating in agile development processes.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "AWS", "evidence": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud"}, {"skill": "Azure", "evidence": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud"}, {"skill": "Google Cloud", "evidence": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud"}, {"skill": "Terraform", "evidence": "Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning"}, {"skill": "Kubernetes", "evidence": "Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning"}, {"skill": "CloudFormation", "evidence": "Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning"}, {"skill": "Python", "evidence": "Writing scripts in Python, Go or Bash"}, {"skill": "Go", "evidence": "Writing scripts in Python, Go or Bash"}, {"skill": "Bash", "evidence": "Writing scripts in Python, Go or Bash"}], "notes": ""}
{"id": "jd_005", "source_url": "https://lemon.io/remote-job-descriptions/back-end-developer/", "role_title": "Back‑End Developer", "jd_text": "Creating server‑side logic and designing web applications using back‑end frameworks. Writing robust, scalable code with languages such as Node.js, Python, Ruby, PHP or Java. Optimizing performance and security, integrating databases such as MySQL, PostgreSQL or MongoDB, and building RESTful APIs. Collaborating with front‑end teams, writing tests and participating in code reviews. Using version control systems like Git and deploying solutions on cloud platforms including AWS, GCP and Azure.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Node.js", "evidence": "Writing robust, scalable code with languages such as Node.js, Python, Ruby, PHP or Java"}, {"skill": "Python", "evidence": "Writing robust, scalable code with languages such as Node.js, Python, Ruby, PHP or Java"}, {"skill": "Ruby", "evidence": "Writing robust, scalable code with languages such as Node.js, Python, Ruby, PHP or Java"}, {"skill": "PHP", "evidence": "Writing robust, scalable code with languages such as Node.js, Python, Ruby, PHP or Java"}, {"skill": "Java", "evidence": "Writing robust, scalable code with languages such as Node.js, Python, Ruby, PHP or Java"}, {"skill": "MySQL", "evidence": "integrating databases such as MySQL, PostgreSQL or MongoDB"}, {"skill": "PostgreSQL", "evidence": "integrating databases such as MySQL, PostgreSQL or MongoDB"}, {"skill": "MongoDB", "evidence": "integrating databases such as MySQL, PostgreSQL or MongoDB"}, {"skill": "RESTful APIs", "evidence": "building RESTful APIs"}, {"skill": "Git", "evidence": "Using version control systems like Git"}, {"skill": "AWS", "evidence": "deploying solutions on cloud platforms including AWS, GCP and Azure"}, {"skill": "GCP", "evidence": "deploying solutions on cloud platforms including AWS, GCP and Azure"}, {"skill": "Azure", "evidence": "deploying solutions on cloud platforms including AWS, GCP and Azure"}], "notes": ""}
{"id": "jd_006", "source_url": "https://lemon.io/remote-job-descriptions/front-end-developer/", "role_title": "Front‑End Developer", "jd_text": "Creating responsive user interfaces using HTML5, CSS3 and JavaScript frameworks such as React.js, Angular or Vue.js. Writing clean, maintainable code and optimizing the performance and accessibility of web applications. Integrating UI components with RESTful APIs and collaborating with designers and back‑end developers. Using version control systems like Git and testing frameworks such as Jest or Mocha. Ensuring cross‑browser compatibility and participating in code reviews and Agile development.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "HTML5", "evidence": "Creating responsive user interfaces using HTML5, CSS3 and JavaScript frameworks"}, {"skill": "CSS3", "evidence": "Creating responsive user interfaces using HTML5, CSS3 and JavaScript frameworks"}, {"skill": "JavaScript", "evidence": "Creating responsive user interfaces using HTML5, CSS3 and JavaScript frameworks such as React.js, Angular or Vue.js"}, {"skill": "React.js", "evidence": "JavaScript frameworks such as React.js, Angular or Vue.js"}, {"skill": "Angular", "evidence": "JavaScript frameworks such as React.js, Angular or Vue.js"}, {"skill": "Vue.js", "evidence": "JavaScript frameworks such as React.js, Angular or Vue.js"}, {"skill": "RESTful APIs", "evidence": "Integrating UI components with RESTful APIs"}, {"skill": "Git", "evidence": "Using version control systems like Git"}, {"skill": "Jest", "evidence": "testing frameworks such as Jest or Mocha"}, {"skill": "Mocha", "evidence": "testing frameworks such as Jest or Mocha"}], "notes": ""}
{"id": "jd_007", "source_url": "https://resources.workable.com/marketing-manager-job-description", "role_title": "Marketing Manager", "jd_text": "Developing strategies and tactics to boost the company’s reputation and drive qualified traffic. Deploying successful marketing campaigns and owning their implementation from ideation to execution. Experimenting with a variety of organic and paid acquisition channels – content creation, pay per click campaigns, event management, publicity, social media and more. Producing valuable and engaging content for the company’s website and blog that attracts and converts target groups. Building strategic relationships and partnering with key industry players, agencies and vendors. Preparing and monitoring the marketing budget on a quarterly and annual basis and allocating funds wisely. Measuring and reporting on the performance of marketing campaigns and assessing goals. Analyzing consumer behavior and adjusting email and advertising campaigns accordingly. Requirements include demonstrable marketing experience, experience identifying target audiences, knowledge of website analytics tools such as Google Analytics, NetInsight, Omniture and WebTrends, experience setting up Google AdWords campaigns, numeric literacy and experience with spreadsheets, a sense of aesthetics and a love for great copy, up‑to‑date with latest marketing trends and best practices, and a degree in marketing or related field.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Marketing Strategy", "evidence": "Developing strategies and tactics to boost the company’s reputation and drive qualified traffic"}, {"skill": "Campaign Management", "evidence": "Deploying successful marketing campaigns and owning their implementation from ideation to execution"}, {"skill": "Digital Marketing", "evidence": "Experimenting with a variety of organic and paid acquisition channels – content creation, pay per click campaigns, event management, publicity, social media and more"}, {"skill": "Content Creation", "evidence": "Producing valuable and engaging content for the company’s website and blog that attracts and converts target groups"}, {"skill": "Partnership Development", "evidence": "Building strategic relationships and partnering with key industry players, agencies and vendors"}, {"skill": "Budgeting", "evidence": "Preparing and monitoring the marketing budget on a quarterly and annual basis and allocating funds wisely"}, {"skill": "Marketing Analytics", "evidence": "Measuring and reporting on the performance of marketing campaigns and assessing goals"}, {"skill": "Consumer Behavior Analysis", "evidence": "Analyzing consumer behavior and adjusting email and advertising campaigns accordingly"}, {"skill": "Google Analytics", "evidence": "knowledge of website analytics tools such as Google Analytics, NetInsight, Omniture and WebTrends"}, {"skill": "Google AdWords", "evidence": "experience setting up Google AdWords campaigns"}], "notes": ""}
{"id": "jd_008", "source_url": "https://resources.workable.com/sales-representative-job-description", "role_title": "Sales Representative", "jd_text": "Presenting, promoting and selling products or services using solid arguments to existing and prospective customers. Performing cost‑benefit and needs analysis to meet customer needs. Establishing, developing and maintaining positive customer relationships. Reaching out to customer leads through cold calling. Achieving agreed sales targets and outcomes within schedule. Coordinating sales efforts with team members and other departments. Analyzing territory potential, tracking sales and status reports. Keeping abreast of best practices and promotional trends and providing feedback for improvement. Requirements include proven work experience as a sales representative, excellent knowledge of MS Office, familiarity with CRM practices, strong selling, negotiation and communication skills, and ability to deliver presentations tailored to audience needs.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Sales", "evidence": "Presenting, promoting and selling products or services using solid arguments to existing and prospective customers"}, {"skill": "Cost‑Benefit Analysis", "evidence": "Performing cost‑benefit and needs analysis to meet customer needs"}, {"skill": "Customer Relationship Management", "evidence": "Establishing, developing and maintaining positive customer relationships"}, {"skill": "Cold Calling", "evidence": "Reaching out to customer leads through cold calling"}, {"skill": "Sales Targets", "evidence": "Achieving agreed sales targets and outcomes within schedule"}, {"skill": "Team Coordination", "evidence": "Coordinating sales efforts with team members and other departments"}, {"skill": "Territory Analysis", "evidence": "Analyzing territory potential, tracking sales and status reports"}, {"skill": "Market Research", "evidence": "Keeping abreast of best practices and promotional trends"}, {"skill": "CRM Software", "evidence": "familiarity with CRM practices"}, {"skill": "Negotiation", "evidence": "strong selling, negotiation and communication skills"}], "notes": ""}
{"id": "jd_009", "source_url": "https://resources.workable.com/financial-analyst-job-description", "role_title": "Financial Analyst", "jd_text": "Consolidating and analyzing financial data including budgets and income statements. Providing alternatives and recommendations to reduce costs and improve financial performance. Assembling and summarizing data to structure sophisticated reports. Developing financial models, conducting benchmarking and process analysis. Identifying trends and forecasting future requirements. Tracking financial status by comparing actual results with forecasts. Reconciling transactions by comparing and correcting data. Providing analysis to management to guide strategic decisions. Driving process improvement and policy development. Requirements include proven experience as a financial analyst, proficiency in spreadsheets and databases and MS Office and financial software, solid understanding of statistical analysis, strong communication skills, knowledge of financial forecasting, corporate finance and information analysis, and a degree in Finance, Economics or a related field.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Financial Analysis", "evidence": "Consolidating and analyzing financial data including budgets and income statements"}, {"skill": "Cost Reduction", "evidence": "Providing alternatives and recommendations to reduce costs and improve financial performance"}, {"skill": "Financial Reporting", "evidence": "Assembling and summarizing data to structure sophisticated reports"}, {"skill": "Financial Modeling", "evidence": "Developing financial models, conducting benchmarking and process analysis"}, {"skill": "Forecasting", "evidence": "Identifying trends and forecasting future requirements"}, {"skill": "Reconciliation", "evidence": "Reconciling transactions by comparing and correcting data"}, {"skill": "Strategic Planning", "evidence": "Providing analysis to management to guide strategic decisions"}, {"skill": "Process Improvement", "evidence": "Driving process improvement and policy development"}, {"skill": "Spreadsheets", "evidence": "proficiency in spreadsheets and databases and MS Office and financial software"}, {"skill": "Statistical Analysis", "evidence": "solid understanding of statistical analysis"}], "notes": ""}
{"id": "jd_010", "source_url": "https://resources.workable.com/product-manager-job-description", "role_title": "Product Manager", "jd_text": "Gaining a deep understanding of customer experience and identifying product gaps and growth opportunities. Creating buy‑in for the product vision both internally and with key external partners. Developing product pricing and positioning strategies. Translating product strategy into detailed requirements and prototypes. Scoping and prioritizing activities based on business and customer impact. Working closely with engineering teams to deliver with quick time to market. Driving product launches including working with PR, marketing team and executives. Evaluating promotional plans to ensure that they are consistent with product strategy. Acting as a product evangelist and representing the company with customers to solicit feedback on company products and services. Requirements include proven work experience as a product manager or associate product manager, track record in managing all aspects of a successful product lifecycle, solid technical background with understanding of software development and web technologies, problem‑solving skills and ability to work with cross‑functional teams, excellent written and verbal communication skills and a degree in computer science, engineering or related field.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Product Strategy", "evidence": "Gaining a deep understanding of customer experience and identifying product gaps and growth opportunities"}, {"skill": "Product Vision", "evidence": "Creating buy‑in for the product vision both internally and with key external partners"}, {"skill": "Pricing", "evidence": "Developing product pricing and positioning strategies"}, {"skill": "Requirements Gathering", "evidence": "Translating product strategy into detailed requirements and prototypes"}, {"skill": "Prioritization", "evidence": "Scoping and prioritizing activities based on business and customer impact"}, {"skill": "Cross‑Functional Collaboration", "evidence": "Working closely with engineering teams to deliver with quick time to market"}, {"skill": "Product Launch", "evidence": "Driving product launches including working with PR, marketing team and executives"}, {"skill": "Promotional Evaluation", "evidence": "Evaluating promotional plans to ensure that they are consistent with product strategy"}, {"skill": "Technical Background", "evidence": "solid technical background with understanding of software development and web technologies"}, {"skill": "Communication", "evidence": "excellent written and verbal communication skills"}], "notes": ""}
{"id": "jd_011", "source_url": "https://resources.workable.com/support-specialist-job-description", "role_title": "Support Specialist", "jd_text": "Advising customers on how to optimize their recruitment processes to solve real‑life hiring problems. Responding to customer inquiries with timely and friendly advice. Supporting users with troubleshooting by providing guidelines, pinpointing root causes and helping fix issues. Reviewing job descriptions and suggesting improvements to ensure they are inclusive, concise and appealing. Collaborating with product, business and engineering teams to improve user experience and processes. Requirements include being tech‑savvy and comfortable with productivity tools, excellent communication skills to guide users, self‑motivated with a positive attitude, ability to work in shifts and during weekends and holidays, a college degree, 1–3 years of experience in customer support, and a willingness to help. Candidates with technical education or account management experience and writing or editing job descriptions are preferred.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Customer Support", "evidence": "Responding to customer inquiries with timely and friendly advice"}, {"skill": "Troubleshooting", "evidence": "Supporting users with troubleshooting by providing guidelines, pinpointing root causes and helping fix issues"}, {"skill": "Recruitment Advising", "evidence": "Advising customers on how to optimize their recruitment processes"}, {"skill": "Job Description Editing", "evidence": "Reviewing job descriptions and suggesting improvements to ensure they are inclusive, concise and appealing"}, {"skill": "Collaboration", "evidence": "Collaborating with product, business and engineering teams to improve user experience and processes"}, {"skill": "Technical Proficiency", "evidence": "being tech‑savvy and comfortable with productivity tools"}, {"skill": "Communication", "evidence": "excellent communication skills to guide users"}, {"skill": "Shift Work", "evidence": "ability to work in shifts and during weekends and holidays"}], "notes": ""}
{"id": "jd_012", "source_url": "https://resources.workable.com/hr-manager-job-description", "role_title": "HR Manager", "jd_text": "Developing and implementing HR strategies and initiatives aligned with the overall business strategy. Bridging management and employee relations by addressing demands, grievances or other issues. Managing the recruitment and selection process. Supporting current and future business needs through the development, engagement, motivation and preservation of human capital. Developing and monitoring overall HR strategies, systems, tactics and procedures across the organization. Nurturing a positive working environment. Overseeing and managing a performance appraisal system that drives high performance. Maintaining pay plan and benefits program. Assessing training needs to apply and monitor training programs. Ensuring legal compliance throughout human resource management. Requirements include proven work experience as HR Manager or other HR Executive, people oriented and results driven attitude, knowledge of HR systems and databases, ability to architect strategy along with leadership skills, excellent active listening, negotiation and presentation skills, competence to build and manage interpersonal relationships at all levels of the company, knowledge of labor law and best practices, and a degree in Human Resources or related field.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "HR Strategy", "evidence": "Developing and implementing HR strategies and initiatives aligned with the overall business strategy"}, {"skill": "Employee Relations", "evidence": "Bridging management and employee relations by addressing demands, grievances or other issues"}, {"skill": "Recruitment", "evidence": "Managing the recruitment and selection process"}, {"skill": "Talent Development", "evidence": "Supporting current and future business needs through the development, engagement, motivation and preservation of human capital"}, {"skill": "Performance Management", "evidence": "Overseeing and managing a performance appraisal system that drives high performance"}, {"skill": "Compensation and Benefits", "evidence": "Maintaining pay plan and benefits program"}, {"skill": "Training", "evidence": "Assessing training needs to apply and monitor training programs"}, {"skill": "Legal Compliance", "evidence": "Ensuring legal compliance throughout human resource management"}, {"skill": "HR Systems", "evidence": "knowledge of HR systems and databases"}, {"skill": "Leadership", "evidence": "ability to architect strategy along with leadership skills"}], "notes": ""}
{"id": "jd_013", "source_url": "https://www.betterteam.com/data-analyst-job-description", "role_title": "Data Analyst", "jd_text": "Managing master data including creation, updates and deletion. Managing users and user roles and providing quality assurance of imported data. Processing confidential data and information according to guidelines. Managing and designing the reporting environment including data sources, security and metadata. Supporting data warehouses in identifying and revising reporting requirements and ensuring data integrity. Generating reports from single or multiple systems and troubleshooting the reporting environment. Evaluating changes to source systems and training end users on new reports and dashboards. Providing technical expertise in data storage structures, data mining and data cleansing. Requirements include a bachelor’s degree in computer science, work experience as a data analyst, ability to assess potential risks and translate business requirements, experience with methodologies for managing large-scale databases and handling large datasets, understanding of addressing and metadata standards, and excellent written and verbal communication skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Data Management", "evidence": "Managing master data including creation, updates and deletion"}, {"skill": "User Administration", "evidence": "Managing users and user roles"}, {"skill": "Data Quality Assurance", "evidence": "providing quality assurance of imported data"}, {"skill": "Data Security", "evidence": "Processing confidential data and information according to guidelines"}, {"skill": "Reporting", "evidence": "Managing and designing the reporting environment including data sources, security and metadata"}, {"skill": "Data Warehousing", "evidence": "Supporting data warehouses in identifying and revising reporting requirements"}, {"skill": "Risk Assessment", "evidence": "ability to assess potential risks"}, {"skill": "SQL", "evidence": "experience with methodologies for managing large-scale databases and handling large datasets"}, {"skill": "Data Mining", "evidence": "Providing technical expertise in data storage structures, data mining and data cleansing"}, {"skill": "Data Cleansing", "evidence": "Providing technical expertise in data storage structures, data mining and data cleansing"}], "notes": ""}
{"id": "jd_014", "source_url": "https://www.betterteam.com/business-analyst-job-description", "role_title": "Business Analyst", "jd_text": "Evaluating business processes, anticipating requirements, uncovering areas for improvement, and developing and implementing solutions. Leading ongoing reviews of business processes and developing optimization strategies. Staying up‑to‑date on the latest process and IT advancements to automate and modernize systems. Conducting meetings and presentations to share ideas and findings. Performing requirements analysis and documenting and communicating results. Effectively communicating insights and plans to cross‑functional team members and management. Gathering critical information from meetings with various stakeholders and producing useful reports. Working closely with clients, technicians, and managerial staff. Providing leadership, training, coaching, and guidance to junior staff. Allocating resources and maintaining cost efficiency. Ensuring solutions meet business needs and requirements. Performing user acceptance testing. Managing projects, developing project plans, and monitoring performance. Updating, implementing, and maintaining procedures. Prioritizing initiatives based on business needs and requirements. Serving as a liaison between stakeholders and users and managing competing resources and priorities. Requirements include a bachelor’s degree in business or related field or an MBA, at least 5 years of experience, exceptional analytical and conceptual thinking skills, ability to influence stakeholders and work closely to determine acceptable solutions, advanced technical skills, excellent documentation skills, experience creating detailed reports and giving presentations, competency in Microsoft applications including Word, Excel and Outlook, excellent planning, organizational and time management skills, experience leading and developing teams and a history of supporting successful projects.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Process Evaluation", "evidence": "Evaluating business processes, anticipating requirements, uncovering areas for improvement, and developing and implementing solutions"}, {"skill": "Optimization Strategies", "evidence": "Leading ongoing reviews of business processes and developing optimization strategies"}, {"skill": "IT Advancements", "evidence": "Staying up‑to‑date on the latest process and IT advancements to automate and modernize systems"}, {"skill": "Requirements Analysis", "evidence": "Performing requirements analysis"}, {"skill": "Documentation", "evidence": "documenting and communicating results"}, {"skill": "Communication", "evidence": "Effectively communicating insights and plans to cross‑functional team members and management"}, {"skill": "Stakeholder Engagement", "evidence": "Gathering critical information from meetings with various stakeholders and producing useful reports"}, {"skill": "Leadership", "evidence": "Providing leadership, training, coaching, and guidance to junior staff"}, {"skill": "Project Management", "evidence": "Managing projects, developing project plans, and monitoring performance"}, {"skill": "User Acceptance Testing", "evidence": "Performing user acceptance testing"}], "notes": ""}
{"id": "jd_015", "source_url": "https://www.betterteam.com/network-engineer-job-description", "role_title": "Network Engineer", "jd_text": "Maintaining and administering computer networks and related computing environments including systems software, applications software, hardware, and configurations. Performing disaster recovery operations and data backups when required. Protecting data, software and hardware by coordinating, planning and implementing network security measures. Troubleshooting, diagnosing and resolving hardware, software and other network and system problems. Replacing faulty network hardware components when required. Maintaining, configuring and monitoring virus protection software and email applications. Monitoring network performance to determine if adjustments need to be made. Conferring with network users about solving existing system problems. Operating master consoles to monitor the performance of networks and computer systems. Coordinating computer network access and use. Designing, configuring, and testing networking software, computer hardware, and operating system software. Requirements include a bachelor’s degree in IT with network engineering focus, strong understanding of network infrastructure and hardware, ability to implement, administer and troubleshoot network devices including wireless access points, firewalls, routers, switches and controllers, knowledge of application transport and network infrastructure protocols, ability to create network diagrams, ability to learn new technologies quickly, good analytical and problem‑solving skills, dependability and flexibility, network security experience and LAN/WAN experience.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Network Administration", "evidence": "Maintaining and administering computer networks and related computing environments"}, {"skill": "Disaster Recovery", "evidence": "Performing disaster recovery operations and data backups when required"}, {"skill": "Network Security", "evidence": "Protecting data, software and hardware by coordinating, planning and implementing network security measures"}, {"skill": "Troubleshooting", "evidence": "Troubleshooting, diagnosing and resolving hardware, software and other network and system problems"}, {"skill": "Virus Protection", "evidence": "Maintaining, configuring and monitoring virus protection software"}, {"skill": "Performance Monitoring", "evidence": "Monitoring network performance to determine if adjustments need to be made"}, {"skill": "Network Design", "evidence": "Designing, configuring, and testing networking software, computer hardware, and operating system software"}, {"skill": "Routers", "evidence": "ability to implement, administer and troubleshoot network devices including wireless access points, firewalls, routers, switches and controllers"}, {"skill": "Switches", "evidence": "ability to implement, administer and troubleshoot network devices including wireless access points, firewalls, routers, switches and controllers"}, {"skill": "Firewalls", "evidence": "ability to implement, administer and troubleshoot network devices including wireless access points, firewalls, routers, switches and controllers"}], "notes": ""}
{"id": "jd_016", "source_url": "https://www.betterteam.com/information-security-analyst-job-description", "role_title": "Information Security Analyst", "jd_text": "Monitoring computer networks for security issues. Investigating security breaches and other cybersecurity incidents. Installing security measures and operating software to protect systems and information infrastructure, including firewalls and data encryption programs. Documenting security breaches and assessing the damage they cause. Working with the security team to perform tests and uncover network vulnerabilities. Fixing detected vulnerabilities to maintain a high security standard. Staying current on IT security trends and news and developing company‑wide best practices for IT security. Performing penetration testing. Helping colleagues install security software and understand information security management. Researching security enhancements and making recommendations to management. Requirements include a bachelor’s degree in computer science or related field, experience in information security, experience with computer network penetration testing and techniques, understanding of firewalls, proxies, SIEM, antivirus, and intrusion detection/prevention systems, ability to identify and mitigate network vulnerabilities, understanding of patch management and ability to deploy patches, and strong communication skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Network Monitoring", "evidence": "Monitoring computer networks for security issues"}, {"skill": "Incident Response", "evidence": "Investigating security breaches and other cybersecurity incidents"}, {"skill": "Security Software", "evidence": "Installing security measures and operating software to protect systems and information infrastructure, including firewalls and data encryption programs"}, {"skill": "Documentation", "evidence": "Documenting security breaches and assessing the damage they cause"}, {"skill": "Vulnerability Assessment", "evidence": "perform tests and uncover network vulnerabilities"}, {"skill": "Penetration Testing", "evidence": "Performing penetration testing"}, {"skill": "Security Training", "evidence": "Helping colleagues install security software and understand information security management"}, {"skill": "Research and Recommendation", "evidence": "Researching security enhancements and making recommendations to management"}, {"skill": "Firewall Management", "evidence": "understanding of firewalls, proxies, SIEM, antivirus, and intrusion detection/prevention systems"}, {"skill": "Patch Management", "evidence": "understanding of patch management and ability to deploy patches"}], "notes": ""}
{"id": "jd_017", "source_url": "https://www.betterteam.com/network-administrator-job-description", "role_title": "Network Administrator", "jd_text": "Assessing a company or organization’s network and computer system needs. Installing hardware and software. Making upgrades and repairs as needed. Overseeing digital security. Performing maintenance to ensure that all systems are operating. Collecting and analyzing data to optimize performance. Onboarding users to the network and training users on hardware and software. Troubleshooting problems with the system. Overseeing local area network and wide area network. Requirements include a bachelor’s degree in IT or computer science, strong understanding of computer network infrastructure, ability to implement, administer and troubleshoot network devices, knowledge of application transport and network protocols, ability to create network diagrams and documentation, ability to learn new technologies using documentation and internet resources, ability to work with all levels of staff, analytical and problem‑solving skills, dependability, flexibility, and experience with LAN and WAN administration.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Needs Assessment", "evidence": "Assessing a company or organization’s network and computer system needs"}, {"skill": "Hardware Installation", "evidence": "Installing hardware and software"}, {"skill": "Upgrades and Repairs", "evidence": "Making upgrades and repairs as needed"}, {"skill": "Digital Security", "evidence": "Overseeing digital security"}, {"skill": "Maintenance", "evidence": "Performing maintenance to ensure that all systems are operating"}, {"skill": "Performance Optimization", "evidence": "Collecting and analyzing data to optimize performance"}, {"skill": "User Training", "evidence": "Onboarding users to the network and training users on hardware and software"}, {"skill": "Troubleshooting", "evidence": "Troubleshooting problems with the system"}, {"skill": "LAN/WAN Administration", "evidence": "Overseeing local area network and wide area network"}], "notes": ""}
{"id": "jd_018", "source_url": "https://www.betterteam.com/network-specialist-job-description", "role_title": "Network Specialist", "jd_text": "Determining company needs and coordinating the development and maintenance of network infrastructures with the IT team. Ensuring secure and stable server connectivity and testing network protocols. Creating internet domains and optimizing intranet performance. Testing data exchange and communication between computers, routers, modems and servers. Installing, updating and configuring end-user networking accessories. Monitoring server capacity and performance to keep up with demand in online traffic. Running diagnostic tests and performing repairs, as well as developing backup, archiving and data retrieval procedures. Training junior IT staff, preparing user manuals and providing remote or onsite technical support. Enhancing network security and documenting network processes and cabling layouts. Keeping informed of developments in network technologies and infrastructure. Requirements include a bachelor’s degree in computer science or information science, certifications such as CompTIA, Microsoft or Cisco network professional, at least two years of experience, extensive knowledge of network connectivity, technologies, protocols and security, strong analytical and problem-solving skills, excellent interpersonal, communication and collaboration skills, great organizational and time management skills, willingness to visit client locations and availability to perform repairs outside business hours.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Network Design", "evidence": "coordinating the development and maintenance of network infrastructures with the IT team"}, {"skill": "Server Connectivity", "evidence": "Ensuring secure and stable server connectivity and testing network protocols"}, {"skill": "Intranet Optimization", "evidence": "Creating internet domains and optimizing intranet performance"}, {"skill": "Data Exchange Testing", "evidence": "Testing data exchange and communication between computers, routers, modems and servers"}, {"skill": "Hardware Installation", "evidence": "Installing, updating and configuring end-user networking accessories"}, {"skill": "Capacity Planning", "evidence": "Monitoring server capacity and performance to keep up with demand in online traffic"}, {"skill": "Diagnostics and Repair", "evidence": "Running diagnostic tests and performing repairs"}, {"skill": "Backup and Archiving", "evidence": "developing backup, archiving and data retrieval procedures"}, {"skill": "Training", "evidence": "Training junior IT staff, preparing user manuals and providing remote or onsite technical support"}, {"skill": "Network Security", "evidence": "Enhancing network security and documenting network processes and cabling layouts"}], "notes": ""}
{"id": "jd_019", "source_url": "https://www.betterteam.com/noc-engineer-job-description", "role_title": "NOC Engineer", "jd_text": "Deploying and inspecting IT network systems. Overseeing the safe installation of hardware and cabling systems. Monitoring the performance and capacity of computer systems. Performing regular checks on network hardware and software. Responding to network alerts and hardware malfunctions. Diagnosing and troubleshooting network errors. Tracking and documenting network issues and compiling incident reports. Responding to user requests and providing network training. Managing system backups and network security protocols. Requirements include a bachelor’s degree in computer science or engineering, experience as an NOC engineer, experience deploying, managing and troubleshooting network infrastructures, knowledge of server hardware systems such as Dell Blade, UCS and HP, excellent troubleshooting skills, ability to work flexible hours, good communication skills and advanced project management skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Network Deployment", "evidence": "Deploying and inspecting IT network systems"}, {"skill": "Hardware Installation", "evidence": "Overseeing the safe installation of hardware and cabling systems"}, {"skill": "Performance Monitoring", "evidence": "Monitoring the performance and capacity of computer systems"}, {"skill": "Maintenance Checks", "evidence": "Performing regular checks on network hardware and software"}, {"skill": "Alert Response", "evidence": "Responding to network alerts and hardware malfunctions"}, {"skill": "Troubleshooting", "evidence": "Diagnosing and troubleshooting network errors"}, {"skill": "Incident Documentation", "evidence": "Tracking and documenting network issues and compiling incident reports"}, {"skill": "User Training", "evidence": "Responding to user requests and providing network training"}, {"skill": "System Backups", "evidence": "Managing system backups and network security protocols"}], "notes": ""}
{"id": "jd_020", "source_url": "https://www.betterteam.com/data-specialist-job-description", "role_title": "Data Specialist", "jd_text": "Conducting thorough data analysis of clients' information and storage systems. Creating or implementing digital conversion programs in line with client needs. Installing and maintaining data collation software. Verifying and extracting data from hardcopy and other digital sources. Importing and transferring data to a secure central database. Performing regular data integrity and quality audits. Creating and submitting data collation reports. Troubleshooting information storage issues. Training staff on data storage and retrieval processes. Requirements include a bachelor’s degree in information management or related field, 3+ years experience as a data specialist, ability to read, interpret and verify data from multiple formats, in-depth knowledge of data retrieval and storage systems, ability to work independently, knowledge of computer hardware systems and peripherals, excellent communication and report-writing skills, strong analytical and problem-solving skills and experience with end-user training and support.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Data Analysis", "evidence": "Conducting thorough data analysis of clients' information and storage systems"}, {"skill": "Digital Conversion", "evidence": "Creating or implementing digital conversion programs in line with client needs"}, {"skill": "Data Collation Software", "evidence": "Installing and maintaining data collation software"}, {"skill": "Data Verification", "evidence": "Verifying and extracting data from hardcopy and other digital sources"}, {"skill": "Data Import", "evidence": "Importing and transferring data to a secure central database"}, {"skill": "Quality Audits", "evidence": "Performing regular data integrity and quality audits"}, {"skill": "Reporting", "evidence": "Creating and submitting data collation reports"}, {"skill": "Troubleshooting", "evidence": "Troubleshooting information storage issues"}, {"skill": "Training", "evidence": "Training staff on data storage and retrieval processes"}], "notes": ""}
{"id": "jd_021", "source_url": "https://www.betterteam.com/data-coordinator-job-description", "role_title": "Data Coordinator", "jd_text": "Using SQL and similar software to run data queries. Maintaining data integrity and security. Ensuring proper sorting and organizing of databases. Taking extra security precautions when handling personally identifiable data. Adhering to legal and regulatory standards and company data guidelines. Transforming or transferring data upon request. Translating data into different languages. Maintaining data on storage devices such as servers, flash drives, and other external devices. Performing data requests in a timely manner. Preparing data for meetings and presentations and communicating data reports to clients. Ensuring data is adequately backed up. Assisting staff with data entry methods. Requirements include a degree in information systems or related field, experience with database administration, proficiency with SQL, analytical mindset, attention to detail, outstanding organizational skills and excellent written and verbal communication and interpersonal skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "SQL", "evidence": "Using SQL and similar software to run data queries"}, {"skill": "Data Integrity", "evidence": "Maintaining data integrity and security"}, {"skill": "Database Organization", "evidence": "Ensuring proper sorting and organizing of databases"}, {"skill": "Data Security", "evidence": "Taking extra security precautions when handling personally identifiable data"}, {"skill": "Data Transformation", "evidence": "Transforming or transferring data upon request"}, {"skill": "Data Backup", "evidence": "Ensuring data is adequately backed up"}, {"skill": "Presentation Preparation", "evidence": "Preparing data for meetings and presentations and communicating data reports to clients"}, {"skill": "Data Entry Support", "evidence": "Assisting staff with data entry methods"}, {"skill": "Organization", "evidence": "outstanding organizational skills"}], "notes": ""}
{"id": "jd_022", "source_url": "https://www.betterteam.com/data-architect-job-description", "role_title": "Data Architect", "jd_text": "Design and implement effective database solutions and models to store and retrieve company data. Examine and identify database structural necessities by evaluating client operations, applications and programming. Assess database implementation procedures to ensure they comply with internal and external regulations. Install and organize information systems to guarantee company functionality. Prepare accurate database design and architecture reports for management and executive teams. Oversee the migration of data from legacy systems to new solutions. Monitor system performance by performing regular tests, troubleshooting and integrating new features. Recommend solutions to improve new and existing database systems. Educate staff members through training and individual support. Offer support by responding to system problems in a timely manner. Requirements include a bachelor’s degree in computer science or relevant field, minimum 5 years experience in a similar role, strong knowledge of database structure systems and data mining, excellent organizational and analytical abilities, problem solving skills and good communication skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Database Design", "evidence": "Design and implement effective database solutions and models to store and retrieve company data"}, {"skill": "Requirements Analysis", "evidence": "Examine and identify database structural necessities by evaluating client operations, applications and programming"}, {"skill": "Regulatory Compliance", "evidence": "Assess database implementation procedures to ensure they comply with internal and external regulations"}, {"skill": "System Installation", "evidence": "Install and organize information systems to guarantee company functionality"}, {"skill": "Reporting", "evidence": "Prepare accurate database design and architecture reports for management and executive teams"}, {"skill": "Data Migration", "evidence": "Oversee the migration of data from legacy systems to new solutions"}, {"skill": "Performance Monitoring", "evidence": "Monitor system performance by performing regular tests, troubleshooting and integrating new features"}, {"skill": "Optimization", "evidence": "Recommend solutions to improve new and existing database systems"}, {"skill": "Training", "evidence": "Educate staff members through training and individual support"}, {"skill": "Support", "evidence": "Offer support by responding to system problems in a timely manner"}], "notes": ""}
{"id": "jd_023", "source_url": "https://www.betterteam.com/data-quality-analyst-job-description", "role_title": "Data Quality Analyst", "jd_text": "Performing statistical tests on large datasets to determine data quality and integrity. Evaluating system performance and design and its effect on data quality. Collaborating with database developers to improve data collection and storage processes. Running data queries to identify coding issues and data exceptions, as well as cleaning data. Gathering data from primary or secondary sources to identify and interpret trends. Reporting data analysis findings to management to inform business decisions and prioritize information system needs. Documenting processes and maintaining data records. Adhering to best practices in data analysis and collection. Keeping abreast of developments and trends in data quality analysis. Requirements include a bachelor’s degree in statistics, mathematics, computer science or information management, at least 5 years of experience, proficiency in SQL and JavaScript, in-depth knowledge of statistical methods and tests, experience with statistical packages such as Excel, SAS and SPSS, exceptional analytical and problem-solving skills, knowledge of best practices in data analysis, and excellent interpersonal and communication skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Statistical Testing", "evidence": "Performing statistical tests on large datasets to determine data quality and integrity"}, {"skill": "System Evaluation", "evidence": "Evaluating system performance and design and its effect on data quality"}, {"skill": "Process Improvement", "evidence": "Collaborating with database developers to improve data collection and storage processes"}, {"skill": "Data Querying", "evidence": "Running data queries to identify coding issues and data exceptions"}, {"skill": "Data Cleaning", "evidence": "as well as cleaning data"}, {"skill": "Trend Analysis", "evidence": "Gathering data from primary or secondary sources to identify and interpret trends"}, {"skill": "Reporting", "evidence": "Reporting data analysis findings to management to inform business decisions and prioritize information system needs"}, {"skill": "Documentation", "evidence": "Documenting processes and maintaining data records"}, {"skill": "SQL", "evidence": "proficiency in SQL and JavaScript"}, {"skill": "JavaScript", "evidence": "proficiency in SQL and JavaScript"}], "notes": ""}
{"id": "jd_024", "source_url": "https://www.betterteam.com/database-manager-job-description", "role_title": "Database Manager", "jd_text": "Enhancing the scalability and performance of existing database architecture. Developing database structures and features according to organizational needs. Hiring, supervising and mentoring database development teams. Protecting data by developing data security and restoration policies, procedures and controls. Conducting diagnostic tests and evaluating performance metrics. Developing procedures to ensure data integrity and quality. Preparing and presenting system performance reports to senior managers. Performing database maintenance, migration, and upgrading hardware and software. Documenting processes and complying with best practices in database management. Keeping up to date with developments and trends in database management. Requirements include a bachelor’s degree in management information systems or related field, at least 2 years of experience, advanced proficiency in SQL, in-depth knowledge of database technologies, architecture and data security, knowledge of best practices in database management, advanced analytical, leadership and problem-solving skills, exceptional organizational skills and excellent interpersonal and communication skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Database Performance", "evidence": "Enhancing the scalability and performance of existing database architecture"}, {"skill": "Database Design", "evidence": "Developing database structures and features according to organizational needs"}, {"skill": "Team Leadership", "evidence": "Hiring, supervising and mentoring database development teams"}, {"skill": "Data Security", "evidence": "Protecting data by developing data security and restoration policies, procedures and controls"}, {"skill": "Diagnostics", "evidence": "Conducting diagnostic tests and evaluating performance metrics"}, {"skill": "Data Integrity", "evidence": "Developing procedures to ensure data integrity and quality"}, {"skill": "Reporting", "evidence": "Preparing and presenting system performance reports to senior managers"}, {"skill": "Database Maintenance", "evidence": "Performing database maintenance, migration, and upgrading hardware and software"}, {"skill": "Documentation", "evidence": "Documenting processes and complying with best practices in database management"}, {"skill": "SQL", "evidence": "advanced proficiency in SQL"}], "notes": ""}
{"id": "jd_025", "source_url": "https://www.betterteam.com/data-manager-job-description", "role_title": "Data Manager", "jd_text": "Develop and implement procedures for effective data management. Create rules and procedures for data sharing. Oversee and manage staff members in the daily use of data systems. Guarantee adherence to legal and company regulations. Regularly monitor and evaluate information and data systems that could affect analytical results. Assess system performance and make recommendations for software, hardware and data storage improvements. Manage all incoming data files. Continually develop data management strategies. Assist with recognizing and upholding digital security systems to protect delicate information. Requirements include a bachelor’s degree in computer science or related field, at least 3 years’ experience in data management or analysis, ability to decipher and organize large amounts of data, analytical mindset with excellent communication and problem-solving skills, and ability to translate complex problems in nontechnical terms.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Data Management", "evidence": "Develop and implement procedures for effective data management"}, {"skill": "Data Governance", "evidence": "Create rules and procedures for data sharing"}, {"skill": "Team Supervision", "evidence": "Oversee and manage staff members in the daily use of data systems"}, {"skill": "Compliance", "evidence": "Guarantee adherence to legal and company regulations"}, {"skill": "System Monitoring", "evidence": "Regularly monitor and evaluate information and data systems that could affect analytical results"}, {"skill": "Performance Assessment", "evidence": "Assess system performance and make recommendations for software, hardware and data storage improvements"}, {"skill": "Data Handling", "evidence": "Manage all incoming data files"}, {"skill": "Strategy Development", "evidence": "Continually develop data management strategies"}, {"skill": "Security", "evidence": "Assist with recognizing and upholding digital security systems to protect delicate information"}], "notes": ""}
{"id": "jd_026", "source_url": "https://www.betterteam.com/database-administrator-job-description", "role_title": "Database Administrator", "jd_text": "Monitoring system performance and identifying problems that arise. Responding in a timely manner to user‑reported errors. Protecting the database against threats or unauthorized access. Ensuring that the database is adequately backed up and able to be recovered in the event of memory loss. Reporting on metrics regarding usage and performance. Suggesting changes and improvements for database maintenance or protection. Regularly liaising with IT project managers and database programmers. Designing databases with both front-end and back-end users in mind. Requirements include a bachelor’s degree in computer science or related field, advanced certifications such as MCDBA or MCSD, minimum 3 years' experience as a database administrator, proficiency in data manipulation languages including MS SQL, Oracle Database, Hadoop or PostgreSQL, analytical mindset and problem-solving skills, excellent communication skills and ability to work under pressure, organization and responsibility, and knowledge of trends and developments in database administration.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Performance Monitoring", "evidence": "Monitoring system performance and identifying problems that arise"}, {"skill": "Incident Response", "evidence": "Responding in a timely manner to user‑reported errors"}, {"skill": "Database Security", "evidence": "Protecting the database against threats or unauthorized access"}, {"skill": "Backup and Recovery", "evidence": "Ensuring that the database is adequately backed up and able to be recovered in the event of memory loss"}, {"skill": "Reporting", "evidence": "Reporting on metrics regarding usage and performance"}, {"skill": "Maintenance", "evidence": "Suggesting changes and improvements for database maintenance or protection"}, {"skill": "Collaboration", "evidence": "Regularly liaising with IT project managers and database programmers"}, {"skill": "Database Design", "evidence": "Designing databases with both front-end and back-end users in mind"}, {"skill": "SQL", "evidence": "proficiency in data manipulation languages including MS SQL, Oracle Database, Hadoop or PostgreSQL"}, {"skill": "Problem Solving", "evidence": "analytical mindset and problem-solving skills"}], "notes": ""}
{"id": "jd_027", "source_url": "https://www.betterteam.com/data-entry-operator-job-description", "role_title": "Data Entry Operator", "jd_text": "Gathering, collating and preparing documents, materials and information for data entry. Conducting research to obtain information for incomplete documents and materials. Creating digital documents from paper or dictation. Reviewing all documents and information for accuracy and informing the supervisor of any errors or inconsistencies. Capturing data into digital databases and performing regular backups. Updating and maintaining databases, archives and filing systems. Monitoring and reviewing databases and correcting errors or inconsistencies. Generating and exporting data reports, spreadsheets and documents as needed. Performing clerical duties such as filing, monitoring office supplies, scanning and printing as needed. Requirements include a high school diploma, 1 year experience as data entry operator, excellent typing abilities, time management and multitasking abilities, proficiency in data capturing and office management software such as MS Office and Google Suite, ability to manage and process high volumes of data accurately, good understanding of databases and filing systems, knowledge of administrative and clerical operations, keen eye for detail and excellent communication skills.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Data Preparation", "evidence": "Gathering, collating and preparing documents, materials and information for data entry"}, {"skill": "Research", "evidence": "Conducting research to obtain information for incomplete documents and materials"}, {"skill": "Document Creation", "evidence": "Creating digital documents from paper or dictation"}, {"skill": "Quality Review", "evidence": "Reviewing all documents and information for accuracy"}, {"skill": "Data Entry", "evidence": "Capturing data into digital databases and performing regular backups"}, {"skill": "Database Maintenance", "evidence": "Updating and maintaining databases, archives and filing systems"}, {"skill": "Error Correction", "evidence": "Monitoring and reviewing databases and correcting errors or inconsistencies"}, {"skill": "Reporting", "evidence": "Generating and exporting data reports, spreadsheets and documents as needed"}, {"skill": "Administrative Tasks", "evidence": "Performing clerical duties such as filing, monitoring office supplies, scanning and printing as needed"}, {"skill": "MS Office", "evidence": "proficiency in data capturing and office management software such as MS Office and Google Suite"}], "notes": ""}
{"id": "jd_028", "source_url": "https://www.betterteam.com/data-entry-specialist-job-description", "role_title": "Data Entry Specialist", "jd_text": "Collecting and digitizing data such as invoices, canceled bills, client information and financial statements. Maintaining a detailed and organized storage system to ensure data entries are complete and accurate. Keeping a record of hard copy data such as invoices, inventory checklists and other financial documents. Establishing data entry standards by continually updating filing systems to improve data quality. Addressing data inconsistencies by working with administrative staff to locate missing data. Attending to data queries and reporting any major data errors to management. Adhering to best data management practices and maintaining a high standard of accuracy and efficiency. Requirements include a high school diploma, at least one year of experience, excellent knowledge of data entry software such as Ninox, Kintone and OmPrompt Order Management, exceptional organizational skills, keen eye for detail, ability to spot errors, good communication skills, ability to collaborate with staff members, solid time management skills and experience working with Windows, Microsoft Office and Google Suite.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Data Digitization", "evidence": "Collecting and digitizing data such as invoices, canceled bills, client information and financial statements"}, {"skill": "Data Organization", "evidence": "Maintaining a detailed and organized storage system to ensure data entries are complete and accurate"}, {"skill": "Record Keeping", "evidence": "Keeping a record of hard copy data such as invoices, inventory checklists and other financial documents"}, {"skill": "Data Quality", "evidence": "Establishing data entry standards by continually updating filing systems to improve data quality"}, {"skill": "Data Validation", "evidence": "Addressing data inconsistencies by working with administrative staff to locate missing data"}, {"skill": "Query Resolution", "evidence": "Attending to data queries and reporting any major data errors to management"}, {"skill": "Accuracy", "evidence": "Adhering to best data management practices and maintaining a high standard of accuracy and efficiency"}, {"skill": "Data Entry Software", "evidence": "excellent knowledge of data entry software such as Ninox, Kintone and OmPrompt Order Management"}, {"skill": "Organization", "evidence": "exceptional organizational skills"}], "notes": ""}
{"id": "jd_029", "source_url": "https://lemon.io/remote-job-descriptions/laravel-developer/", "role_title": "Laravel Developer", "jd_text": "Designing and managing scalable web applications using the Laravel PHP framework. Writing server-side logic and optimizing performance and responsiveness. Integrating third‑party services and APIs. Collaborating with front‑end developers and product teams to deliver new features. Writing unit tests, conducting code reviews and participating in agile development processes. Requirements include experience with PHP frameworks such as Laravel, strong knowledge of PHP programming and object‑oriented design, proficiency in HTML5, CSS3 and JavaScript, knowledge of databases such as MySQL, PostgreSQL or SQLite, experience integrating RESTful APIs, familiarity with version control systems like Git, ability to optimize performance and ensure security, strong communication and problem-solving skills, and proficiency in English【911055623480696†L172-L190】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Laravel", "evidence": "experience with PHP frameworks such as Laravel"}, {"skill": "PHP", "evidence": "strong knowledge of PHP programming and object‑oriented design"}, {"skill": "HTML5", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "CSS3", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "JavaScript", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "MySQL", "evidence": "knowledge of databases such as MySQL, PostgreSQL or SQLite"}, {"skill": "PostgreSQL", "evidence": "knowledge of databases such as MySQL, PostgreSQL or SQLite"}, {"skill": "SQLite", "evidence": "knowledge of databases such as MySQL, PostgreSQL or SQLite"}, {"skill": "RESTful APIs", "evidence": "experience integrating RESTful APIs"}, {"skill": "Git", "evidence": "familiarity with version control systems like Git"}], "notes": ""}
{"id": "jd_030", "source_url": "https://lemon.io/remote-job-descriptions/dot-net-developer/", "role_title": ".NET Developer", "jd_text": "Creating solutions using C# and the .NET framework. Writing scalable and efficient code and developing databases and APIs. Integrating RESTful APIs and working with Azure services. Participating in code reviews, running unit tests and working in agile processes. Requirements include experience with .NET development, strong knowledge of C#, familiarity with web services and APIs, experience with .NET Core, knowledge of SQL Server, MySQL or PostgreSQL, proficiency with HTML, CSS and JavaScript (plus), proficiency with Git, strong communication and problem-solving skills and proficiency in English【511391555046782†L167-L182】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": ".NET", "evidence": "experience with .NET development"}, {"skill": "C#", "evidence": "Creating solutions using C# and the .NET framework"}, {"skill": "RESTful APIs", "evidence": "Integrating RESTful APIs"}, {"skill": "Azure", "evidence": "working with Azure services"}, {"skill": "Unit Testing", "evidence": "running unit tests"}, {"skill": "SQL Server", "evidence": "knowledge of SQL Server, MySQL or PostgreSQL"}, {"skill": "MySQL", "evidence": "knowledge of SQL Server, MySQL or PostgreSQL"}, {"skill": "PostgreSQL", "evidence": "knowledge of SQL Server, MySQL or PostgreSQL"}, {"skill": "HTML/CSS/JS", "evidence": "proficiency with HTML, CSS and JavaScript (plus)"}, {"skill": "Git", "evidence": "proficiency with Git"}], "notes": ""}
{"id": "jd_031", "source_url": "https://lemon.io/remote-job-descriptions/python-developer/", "role_title": "Python Developer", "jd_text": "Developing Python‑based back‑end solutions and APIs. Creating algorithms and designing database schemas. Integrating services and APIs and working closely with product teams. Participating in code reviews and writing unit tests. Working in agile development processes. Requirements include experience in Python development, expertise in Django or Flask, understanding of object‑oriented programming, proficiency in SQL and relational databases, experience with AWS or other cloud platforms, familiarity with Docker, knowledge of agile methodologies and proficiency in English【90334565568768†L161-L172】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Python", "evidence": "experience in Python development"}, {"skill": "API Development", "evidence": "Developing Python‑based back‑end solutions and APIs"}, {"skill": "Algorithms", "evidence": "Creating algorithms"}, {"skill": "Database Design", "evidence": "designing database schemas"}, {"skill": "Django", "evidence": "expertise in Django or Flask"}, {"skill": "Flask", "evidence": "expertise in Django or Flask"}, {"skill": "OOP", "evidence": "understanding of object‑oriented programming"}, {"skill": "SQL", "evidence": "proficiency in SQL and relational databases"}, {"skill": "AWS", "evidence": "experience with AWS or other cloud platforms"}, {"skill": "Docker", "evidence": "familiarity with Docker"}], "notes": ""}
{"id": "jd_032", "source_url": "https://lemon.io/remote-job-descriptions/vue-js-developer/", "role_title": "Vue.js Developer", "jd_text": "Developing web applications using Vue.js and creating reusable libraries for future use. Designing front‑end components and ensuring they are responsive. Working with cross‑functional teams, writing tests, conducting code reviews and participating in agile processes. Requirements include experience with Vue.js, strong knowledge of JavaScript, proficiency in CSS and HTML, familiarity with tooling like Git, Webpack and Babel, experience with testing frameworks such as Mocha, Jest, Jasmine or Karma, ability to develop RESTful APIs, knowledge of Vue CLI, Vue Router and Nuxt.js, good communication and problem‑solving skills and proficiency in English【123087066014738†L164-L179】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Vue.js", "evidence": "experience with Vue.js"}, {"skill": "JavaScript", "evidence": "strong knowledge of JavaScript"}, {"skill": "CSS", "evidence": "proficiency in CSS and HTML"}, {"skill": "HTML", "evidence": "proficiency in CSS and HTML"}, {"skill": "Git", "evidence": "familiarity with tooling like Git, Webpack and Babel"}, {"skill": "Webpack", "evidence": "familiarity with tooling like Git, Webpack and Babel"}, {"skill": "Babel", "evidence": "familiarity with tooling like Git, Webpack and Babel"}, {"skill": "Testing Frameworks", "evidence": "experience with testing frameworks such as Mocha, Jest, Jasmine or Karma"}, {"skill": "RESTful APIs", "evidence": "ability to develop RESTful APIs"}, {"skill": "Vue CLI", "evidence": "knowledge of Vue CLI, Vue Router and Nuxt.js"}, {"skill": "Vue Router", "evidence": "knowledge of Vue CLI, Vue Router and Nuxt.js"}, {"skill": "Nuxt.js", "evidence": "knowledge of Vue CLI, Vue Router and Nuxt.js"}], "notes": ""}
{"id": "jd_033", "source_url": "https://lemon.io/remote-job-descriptions/ruby-on-rails-developer/", "role_title": "Ruby on Rails Developer", "jd_text": "Developing back‑end solutions using Ruby on Rails. Designing database architectures and ensuring high performance. Integrating external APIs and services. Working with cross‑functional teams, writing unit tests, conducting code reviews and participating in agile processes. Requirements include experience with Ruby on Rails, strong knowledge of object‑oriented programming and design patterns, experience with front‑end frameworks such as React, familiarity with containerization tools like Docker and Kubernetes, experience deploying applications on AWS and knowledge of other cloud solutions, excellent communication and problem‑solving skills and proficiency in English【166344846321313†L164-L176】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Ruby on Rails", "evidence": "experience with Ruby on Rails"}, {"skill": "OOP", "evidence": "strong knowledge of object‑oriented programming and design patterns"}, {"skill": "Design Patterns", "evidence": "strong knowledge of object‑oriented programming and design patterns"}, {"skill": "API Integration", "evidence": "Integrating external APIs and services"}, {"skill": "React", "evidence": "experience with front‑end frameworks such as React"}, {"skill": "Docker", "evidence": "familiarity with containerization tools like Docker and Kubernetes"}, {"skill": "Kubernetes", "evidence": "familiarity with containerization tools like Docker and Kubernetes"}, {"skill": "AWS", "evidence": "experience deploying applications on AWS"}, {"skill": "Cloud Solutions", "evidence": "knowledge of other cloud solutions"}, {"skill": "Unit Testing", "evidence": "writing unit tests"}], "notes": ""}
{"id": "jd_034", "source_url": "https://lemon.io/remote-job-descriptions/unity-developer/", "role_title": "Unity Developer", "jd_text": "Developing game modules and interactive experiences using Unity. Designing game mechanics and ensuring game performance on various platforms. Collaborating with designers, artists and other developers. Writing clean, scalable code and optimizing games for speed and efficiency. Running tests, conducting code reviews and participating in agile processes. Requirements include experience in game development, proficiency with Unity, ability to translate designs into game mechanics, understanding of data structures and algorithms, experience with 3D development, experience developing games for mobile platforms using Unity, knowledge of performance optimization and game debugging, strong communication and problem‑solving skills and proficiency in English【471342306317442†L163-L181】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Unity", "evidence": "proficiency with Unity"}, {"skill": "Game Development", "evidence": "experience in game development"}, {"skill": "Game Mechanics", "evidence": "Designing game mechanics"}, {"skill": "Performance Optimization", "evidence": "optimizing games for speed and efficiency"}, {"skill": "Algorithms", "evidence": "understanding of data structures and algorithms"}, {"skill": "3D Development", "evidence": "experience with 3D development"}, {"skill": "Mobile Game Development", "evidence": "experience developing games for mobile platforms using Unity"}, {"skill": "Testing", "evidence": "Running tests"}, {"skill": "Code Review", "evidence": "conducting code reviews"}, {"skill": "Communication", "evidence": "strong communication and problem‑solving skills"}], "notes": ""}
{"id": "jd_035", "source_url": "https://lemon.io/remote-job-descriptions/game-developer/", "role_title": "Game Developer", "jd_text": "Designing and developing games using game engines such as Unity or Unreal. Writing scalable code for game logic and artificial intelligence. Optimizing game performance and troubleshooting problems. Integrating third‑party tools and APIs, including physics engines, audio libraries and middleware. Collaborating with designers and artists to create immersive experiences. Writing and maintaining documentation, writing tests and participating in code reviews and agile processes. Requirements include experience in game development, proficiency with game engines like Unity or Unreal, deep understanding of game design principles, experience with languages such as C#, C++ or JavaScript, knowledge of API integration and physics engines, version control systems like Git, knowledge of cloud gaming and multiplayer networking, experience with game testing and optimization, strong communication and problem‑solving skills and proficiency in English【127027716726866†L174-L194】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Unity", "evidence": "proficiency with game engines like Unity or Unreal"}, {"skill": "Unreal", "evidence": "proficiency with game engines like Unity or Unreal"}, {"skill": "Game Development", "evidence": "experience in game development"}, {"skill": "Game Design Principles", "evidence": "deep understanding of game design principles"}, {"skill": "C#", "evidence": "experience with languages such as C#, C++ or JavaScript"}, {"skill": "C++", "evidence": "experience with languages such as C#, C++ or JavaScript"}, {"skill": "JavaScript", "evidence": "experience with languages such as C#, C++ or JavaScript"}, {"skill": "API Integration", "evidence": "knowledge of API integration and physics engines"}, {"skill": "Physics Engines", "evidence": "knowledge of API integration and physics engines"}, {"skill": "Git", "evidence": "version control systems like Git"}, {"skill": "Cloud Gaming", "evidence": "knowledge of cloud gaming and multiplayer networking"}, {"skill": "Game Testing", "evidence": "experience with game testing and optimization"}], "notes": ""}
{"id": "jd_036", "source_url": "https://lemon.io/remote-job-descriptions/next-js-developer/", "role_title": "Next.js Developer", "jd_text": "Designing and developing web applications using Next.js. Optimizing performance and implementing server‑side rendering and static site generation. Integrating services and APIs and collaborating with teams. Writing tests, conducting code reviews and participating in agile development. Requirements include experience with Next.js or React, proficiency with HTML5, CSS3 and JavaScript, knowledge of server‑side rendering, static site generation and SEO best practices, experience with JavaScript/TypeScript/Node.js, ability to integrate RESTful and GraphQL APIs, proficiency with Git, knowledge of cloud platforms like Vercel, AWS or Firebase, ability to optimize performance and ensure security, strong communication and problem‑solving skills and proficiency in English【771251986948869†L177-L199】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Next.js", "evidence": "experience with Next.js or React"}, {"skill": "React", "evidence": "experience with Next.js or React"}, {"skill": "HTML5", "evidence": "proficiency with HTML5, CSS3 and JavaScript"}, {"skill": "CSS3", "evidence": "proficiency with HTML5, CSS3 and JavaScript"}, {"skill": "JavaScript", "evidence": "proficiency with HTML5, CSS3 and JavaScript"}, {"skill": "Server‑Side Rendering", "evidence": "knowledge of server‑side rendering"}, {"skill": "Static Site Generation", "evidence": "knowledge of server‑side rendering, static site generation and SEO best practices"}, {"skill": "SEO", "evidence": "knowledge of server‑side rendering, static site generation and SEO best practices"}, {"skill": "Node.js", "evidence": "experience with JavaScript/TypeScript/Node.js"}, {"skill": "TypeScript", "evidence": "experience with JavaScript/TypeScript/Node.js"}, {"skill": "API Integration", "evidence": "ability to integrate RESTful and GraphQL APIs"}, {"skill": "Git", "evidence": "proficiency with Git"}, {"skill": "Vercel", "evidence": "knowledge of cloud platforms like Vercel, AWS or Firebase"}, {"skill": "AWS", "evidence": "knowledge of cloud platforms like Vercel, AWS or Firebase"}, {"skill": "Firebase", "evidence": "knowledge of cloud platforms like Vercel, AWS or Firebase"}], "notes": ""}
{"id": "jd_037", "source_url": "https://lemon.io/remote-job-descriptions/javascript-developer/", "role_title": "JavaScript Developer", "jd_text": "Developing front‑end solutions using JavaScript frameworks such as React.js or Angular. Designing JavaScript‑based user interfaces and ensuring responsive design. Integrating APIs and services with front‑end components. Working with cross‑functional teams, writing tests and participating in code reviews. Requirements include experience with JavaScript and frameworks like Angular or Vue.js and React.js, familiarity with back‑end technologies like Node.js and Express.js, understanding of HTML5 and CSS3, experience with RESTful API integration, knowledge of design patterns, experience with version control systems like Git, strong problem‑solving and communication skills and proficiency in English【842750297142672†L173-L187】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "JavaScript", "evidence": "experience with JavaScript"}, {"skill": "Angular", "evidence": "frameworks like Angular or Vue.js and React.js"}, {"skill": "Vue.js", "evidence": "frameworks like Angular or Vue.js and React.js"}, {"skill": "React.js", "evidence": "frameworks like Angular or Vue.js and React.js"}, {"skill": "Node.js", "evidence": "familiarity with back‑end technologies like Node.js and Express.js"}, {"skill": "Express.js", "evidence": "familiarity with back‑end technologies like Node.js and Express.js"}, {"skill": "HTML5", "evidence": "understanding of HTML5 and CSS3"}, {"skill": "CSS3", "evidence": "understanding of HTML5 and CSS3"}, {"skill": "RESTful API Integration", "evidence": "experience with RESTful API integration"}, {"skill": "Design Patterns", "evidence": "knowledge of design patterns"}, {"skill": "Git", "evidence": "experience with version control systems like Git"}], "notes": ""}
{"id": "jd_038", "source_url": "https://lemon.io/remote-job-descriptions/php-developer/", "role_title": "PHP Developer", "jd_text": "Creating web solutions using PHP and developing web‑based applications. Writing scalable PHP code and improving application performance. Integrating APIs and working with third‑party services. Collaborating with cross‑functional teams, writing unit tests, conducting code reviews and participating in agile development. Requirements include experience with PHP development, knowledge of PHP frameworks such as Laravel, Symfony or CodeIgniter, proficiency in HTML5, CSS3 and JavaScript, knowledge of databases like MySQL, PostgreSQL or MongoDB, familiarity with version control systems like Git, understanding of RESTful API design, experience with testing frameworks such as PHPUnit, Codeception, Behat or PHPSpec, strong communication and problem‑solving skills and proficiency in English【703275572085765†L168-L183】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "PHP", "evidence": "experience with PHP development"}, {"skill": "Laravel", "evidence": "knowledge of PHP frameworks such as Laravel, Symfony or CodeIgniter"}, {"skill": "Symfony", "evidence": "knowledge of PHP frameworks such as Laravel, Symfony or CodeIgniter"}, {"skill": "CodeIgniter", "evidence": "knowledge of PHP frameworks such as Laravel, Symfony or CodeIgniter"}, {"skill": "HTML5", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "CSS3", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "JavaScript", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "MySQL", "evidence": "knowledge of databases like MySQL, PostgreSQL or MongoDB"}, {"skill": "PostgreSQL", "evidence": "knowledge of databases like MySQL, PostgreSQL or MongoDB"}, {"skill": "MongoDB", "evidence": "knowledge of databases like MySQL, PostgreSQL or MongoDB"}, {"skill": "Git", "evidence": "familiarity with version control systems like Git"}, {"skill": "RESTful API", "evidence": "understanding of RESTful API design"}, {"skill": "PHPUnit", "evidence": "experience with testing frameworks such as PHPUnit, Codeception, Behat or PHPSpec"}, {"skill": "Codeception", "evidence": "experience with testing frameworks such as PHPUnit, Codeception, Behat or PHPSpec"}, {"skill": "Behat", "evidence": "experience with testing frameworks such as PHPUnit, Codeception, Behat or PHPSpec"}, {"skill": "PHPSpec", "evidence": "experience with testing frameworks such as PHPUnit, Codeception, Behat or PHPSpec"}], "notes": ""}
{"id": "jd_039", "source_url": "https://lemon.io/remote-job-descriptions/ai-engineer/", "role_title": "AI Engineer", "jd_text": "Creating AI applications and solutions and analyzing and solving problems using artificial intelligence. Developing robust AI‑driven code and working with data to train machine learning models. Collaborating with cross‑functional teams, participating in research initiatives and staying up to date with AI trends. Requirements include experience with AI and machine learning, proficiency in deep learning frameworks such as TensorFlow and PyTorch, programming languages like Python, Java or C++, familiarity with Docker and Kubernetes, experience deploying AI solutions on cloud platforms like AWS, knowledge of RESTful API design, strong communication skills, problem‑solving abilities and proficiency in English【718678726458481†L160-L174】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "AI", "evidence": "experience with AI and machine learning"}, {"skill": "Machine Learning", "evidence": "experience with AI and machine learning"}, {"skill": "TensorFlow", "evidence": "proficiency in deep learning frameworks such as TensorFlow"}, {"skill": "PyTorch", "evidence": "PyTorch"}, {"skill": "Python", "evidence": "programming languages like Python, Java or C++"}, {"skill": "Java", "evidence": "programming languages like Python, Java or C++"}, {"skill": "C++", "evidence": "programming languages like Python, Java or C++"}, {"skill": "Docker", "evidence": "familiarity with Docker and Kubernetes"}, {"skill": "Kubernetes", "evidence": "familiarity with Docker and Kubernetes"}, {"skill": "AWS", "evidence": "experience deploying AI solutions on cloud platforms like AWS"}, {"skill": "RESTful API", "evidence": "knowledge of RESTful API design"}], "notes": ""}
{"id": "jd_040", "source_url": "https://lemon.io/remote-job-descriptions/software-developer/", "role_title": "Software Developer", "jd_text": "Designing and managing high‑performance software applications. Implementing and optimizing code and writing robust and scalable code. Monitoring software performance and identifying potential areas for improvement. Integrating third‑party tools, APIs and databases. Collaborating with cross‑functional teams, writing unit tests, conducting code reviews and participating in agile development. Requirements include proficiency in programming languages such as Java, C#, Python or JavaScript, strong understanding of software architecture, knowledge of UI/UX principles, experience integrating REST APIs, databases and cloud solutions, experience with testing and debugging, proficiency with Git, performance optimization skills, knowledge of software security and best practices, strong communication and problem‑solving abilities【842283704295869†L153-L170】【842283704295869†L172-L194】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Software Design", "evidence": "Designing and managing high‑performance software applications"}, {"skill": "Code Optimization", "evidence": "Implementing and optimizing code and writing robust and scalable code"}, {"skill": "Performance Monitoring", "evidence": "Monitoring software performance and identifying potential areas for improvement"}, {"skill": "API Integration", "evidence": "Integrating third‑party tools, APIs and databases"}, {"skill": "Java", "evidence": "programming languages such as Java, C#, Python or JavaScript"}, {"skill": "C#", "evidence": "programming languages such as Java, C#, Python or JavaScript"}, {"skill": "Python", "evidence": "programming languages such as Java, C#, Python or JavaScript"}, {"skill": "JavaScript", "evidence": "programming languages such as Java, C#, Python or JavaScript"}, {"skill": "Software Architecture", "evidence": "strong understanding of software architecture"}, {"skill": "UI/UX", "evidence": "knowledge of UI/UX principles"}, {"skill": "Git", "evidence": "proficiency with Git"}, {"skill": "Performance Optimization", "evidence": "performance optimization skills"}, {"skill": "Software Security", "evidence": "knowledge of software security and best practices"}], "notes": ""}
{"id": "jd_041", "source_url": "https://lemon.io/remote-job-descriptions/three-js-developer/", "role_title": "Three.js Developer", "jd_text": "Designing and implementing 3D web applications using Three.js. Optimizing 3D rendering and performance. Integrating WebGL and real‑time rendering techniques. Writing modular and reusable code and collaborating with designers and developers. Conducting unit tests, code reviews and participating in agile development. Requirements include experience with Three.js and other 3D frameworks, proficiency in HTML5, CSS3 and JavaScript, understanding of real‑time rendering and animation, experience with programming languages such as JavaScript, TypeScript or WebGL, familiarity with Git, ability to optimize performance and ensure security, strong communication and problem‑solving skills and proficiency in English【486204858372064†L150-L193】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Three.js", "evidence": "experience with Three.js and other 3D frameworks"}, {"skill": "3D Rendering", "evidence": "Optimizing 3D rendering and performance"}, {"skill": "WebGL", "evidence": "Integrating WebGL and real‑time rendering techniques"}, {"skill": "HTML5", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "CSS3", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "JavaScript", "evidence": "proficiency in HTML5, CSS3 and JavaScript"}, {"skill": "TypeScript", "evidence": "experience with programming languages such as JavaScript, TypeScript or WebGL"}, {"skill": "Git", "evidence": "familiarity with Git"}, {"skill": "Performance Optimization", "evidence": "ability to optimize performance and ensure security"}, {"skill": "Communication", "evidence": "strong communication and problem‑solving skills"}], "notes": ""}
{"id": "jd_042", "source_url": "https://lemon.io/remote-job-descriptions/app-developer/", "role_title": "App Developer", "jd_text": "Designing and managing high‑performance mobile applications for iOS, Android or cross‑platform environments. Writing efficient, reusable and reliable code and optimizing performance for mobile devices. Integrating third‑party services and APIs and collaborating with designers and back‑end developers. Writing unit tests, conducting code reviews and participating in agile processes. Requirements include experience in mobile application development, proficiency in Swift or Kotlin or cross‑platform frameworks like React Native or Flutter, understanding of mobile application architecture, experience integrating RESTful APIs and databases, experience deploying apps to the App Store or Google Play, experience with mobile app testing and debugging, proficiency in Git, knowledge of performance optimization and security best practices, excellent communication and problem‑solving skills and proficiency in English【612420070316027†L168-L189】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Mobile Development", "evidence": "experience in mobile application development"}, {"skill": "Swift", "evidence": "proficiency in Swift or Kotlin"}, {"skill": "Kotlin", "evidence": "proficiency in Swift or Kotlin"}, {"skill": "React Native", "evidence": "cross‑platform frameworks like React Native or Flutter"}, {"skill": "Flutter", "evidence": "cross‑platform frameworks like React Native or Flutter"}, {"skill": "Architecture", "evidence": "understanding of mobile application architecture"}, {"skill": "API Integration", "evidence": "experience integrating RESTful APIs and databases"}, {"skill": "Deployment", "evidence": "experience deploying apps to the App Store or Google Play"}, {"skill": "Testing", "evidence": "experience with mobile app testing and debugging"}, {"skill": "Git", "evidence": "proficiency in Git"}, {"skill": "Performance Optimization", "evidence": "knowledge of performance optimization and security best practices"}], "notes": ""}
{"id": "jd_043", "source_url": "https://lemon.io/remote-job-descriptions/android-developer/", "role_title": "Android Developer", "jd_text": "Creating Android applications and writing scalable, maintainable code. Collaborating with cross‑functional teams and optimizing app performance. Reviewing code, integrating APIs and fixing bugs. Deploying applications to Google Play, running tests and participating in agile development. Requirements include experience with Kotlin and proficiency in Java and Android frameworks, familiarity with mobile databases such as SQLite, Realm or Firebase, knowledge of SOLID principles and design patterns, understanding of Android UI/UX standards, API integration experience, knowledge of mobile security protocols, experience with continuous integration and delivery, staying up to date on Android technologies, strong communication and problem‑solving skills and proficiency in English【934880212355546†L168-L191】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Kotlin", "evidence": "experience with Kotlin"}, {"skill": "Java", "evidence": "proficiency in Java and Android frameworks"}, {"skill": "Android Frameworks", "evidence": "proficiency in Java and Android frameworks"}, {"skill": "SQLite", "evidence": "familiarity with mobile databases such as SQLite, Realm or Firebase"}, {"skill": "Realm", "evidence": "familiarity with mobile databases such as SQLite, Realm or Firebase"}, {"skill": "Firebase", "evidence": "familiarity with mobile databases such as SQLite, Realm or Firebase"}, {"skill": "SOLID Principles", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "Design Patterns", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "UI/UX", "evidence": "understanding of Android UI/UX standards"}, {"skill": "API Integration", "evidence": "integrating APIs"}, {"skill": "Security", "evidence": "knowledge of mobile security protocols"}, {"skill": "CI/CD", "evidence": "experience with continuous integration and delivery"}], "notes": ""}
{"id": "jd_044", "source_url": "https://lemon.io/remote-job-descriptions/ios-developer/", "role_title": "iOS Developer", "jd_text": "Developing iOS applications and writing efficient and maintainable code. Integrating applications with services and tools and preparing apps for the App Store. Collaborating with cross‑functional teams, conducting code reviews and writing unit tests, running tests and participating in agile development. Requirements include experience in iOS development, experience with Objective‑C and Swift, knowledge of SOLID principles and architecture patterns, familiarity with UI/UX standards such as SwiftUI and Apple Human Interface Guidelines, experience integrating APIs, knowledge of SSL security protocols and Keychain management, experience with CI/CD processes, staying updated on iOS technologies, strong communication and problem‑solving skills and proficiency in English【985044442707231†L160-L187】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "iOS Development", "evidence": "experience in iOS development"}, {"skill": "Objective-C", "evidence": "experience with Objective‑C and Swift"}, {"skill": "Swift", "evidence": "experience with Objective‑C and Swift"}, {"skill": "SOLID Principles", "evidence": "knowledge of SOLID principles and architecture patterns"}, {"skill": "Architecture Patterns", "evidence": "knowledge of SOLID principles and architecture patterns"}, {"skill": "UI/UX Standards", "evidence": "familiarity with UI/UX standards such as SwiftUI and Apple Human Interface Guidelines"}, {"skill": "API Integration", "evidence": "experience integrating APIs"}, {"skill": "Security Protocols", "evidence": "knowledge of SSL security protocols and Keychain management"}, {"skill": "CI/CD", "evidence": "experience with CI/CD processes"}, {"skill": "Communication", "evidence": "strong communication and problem‑solving skills"}], "notes": ""}
{"id": "jd_045", "source_url": "https://lemon.io/remote-job-descriptions/react-native-developer/", "role_title": "React Native Developer", "jd_text": "Creating cross‑platform mobile applications using React Native. Writing efficient, reusable code and optimizing app performance. Collaborating with cross‑functional teams and improving application performance. Conducting code reviews, connecting applications to services, debugging issues and managing deployments. Participating in agile processes. Requirements include experience with React Native, proficiency in JavaScript and React Native, familiarity with mobile databases, knowledge of SOLID principles and design patterns, understanding of web technologies and mobile UI/UX, experience integrating APIs, knowledge of mobile security protocols, experience with CI/CD pipelines, staying updated on React Native technologies, knowledge of Next.js, TypeScript and Expo as a plus, strong communication and problem‑solving skills and proficiency in English【257389812577061†L168-L190】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "React Native", "evidence": "experience with React Native"}, {"skill": "JavaScript", "evidence": "proficiency in JavaScript and React Native"}, {"skill": "Mobile Databases", "evidence": "familiarity with mobile databases"}, {"skill": "SOLID Principles", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "Design Patterns", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "UI/UX", "evidence": "understanding of web technologies and mobile UI/UX"}, {"skill": "API Integration", "evidence": "experience integrating APIs"}, {"skill": "Security", "evidence": "knowledge of mobile security protocols"}, {"skill": "CI/CD", "evidence": "experience with CI/CD pipelines"}, {"skill": "Next.js", "evidence": "knowledge of Next.js"}, {"skill": "TypeScript", "evidence": "TypeScript"}, {"skill": "Expo", "evidence": "Expo"}], "notes": ""}
{"id": "jd_046", "source_url": "https://lemon.io/remote-job-descriptions/flutter-developer/", "role_title": "Flutter Developer", "jd_text": "Creating cross‑platform applications using Flutter and Dart. Writing efficient, reusable Flutter code and collaborating with teams to improve performance. Conducting code reviews, integrating applications with APIs, resolving technical issues and deploying apps. Participating in agile processes. Requirements include understanding of Android and iOS platforms, proficiency in Flutter and Dart, familiarity with mobile databases such as SQLite, Realm or Firebase, knowledge of SOLID principles and design patterns, understanding of mobile UI/UX standards, experience integrating APIs and security protocols, experience with CI/CD pipelines, staying updated on Flutter technologies, familiarity with Next.js, TypeScript and Expo, strong communication and problem‑solving skills and proficiency in English【111782367444646†L170-L193】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Flutter", "evidence": "proficiency in Flutter and Dart"}, {"skill": "Dart", "evidence": "proficiency in Flutter and Dart"}, {"skill": "Android", "evidence": "understanding of Android and iOS platforms"}, {"skill": "iOS", "evidence": "understanding of Android and iOS platforms"}, {"skill": "SQLite", "evidence": "familiarity with mobile databases such as SQLite, Realm or Firebase"}, {"skill": "Realm", "evidence": "familiarity with mobile databases such as SQLite, Realm or Firebase"}, {"skill": "Firebase", "evidence": "familiarity with mobile databases such as SQLite, Realm or Firebase"}, {"skill": "SOLID Principles", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "Design Patterns", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "UI/UX", "evidence": "understanding of mobile UI/UX standards"}, {"skill": "API Integration", "evidence": "experience integrating APIs and security protocols"}, {"skill": "Security", "evidence": "experience integrating APIs and security protocols"}, {"skill": "CI/CD", "evidence": "experience with CI/CD pipelines"}, {"skill": "Next.js", "evidence": "familiarity with Next.js"}, {"skill": "TypeScript", "evidence": "TypeScript"}, {"skill": "Expo", "evidence": "Expo"}], "notes": ""}
{"id": "jd_047", "source_url": "https://lemon.io/remote-job-descriptions/java-developer/", "role_title": "Java Developer", "jd_text": "Developing business‑grade applications using Java. Writing efficient and maintainable Java code and handling setup and deployment across different platforms. Optimizing performance and debugging issues. Integrating services and APIs and collaborating with cross‑functional teams. Participating in code reviews, running tests and working in agile processes. Requirements include proficiency in Java software development and architecture, experience with Java programming language, familiarity with databases such as Oracle, SQL Server or DB2, knowledge of SOLID principles and design patterns, familiarity with UI frameworks like JavaFX or Swing, experience integrating APIs and using third‑party libraries, knowledge of security protocols such as SSL and cryptographic key management, experience with continuous integration and delivery, staying updated on Java technologies, strong communication and problem‑solving skills and proficiency in English【216255402509504†L168-L191】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Java", "evidence": "proficiency in Java software development"}, {"skill": "Databases", "evidence": "familiarity with databases such as Oracle, SQL Server or DB2"}, {"skill": "SOLID Principles", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "Design Patterns", "evidence": "knowledge of SOLID principles and design patterns"}, {"skill": "JavaFX", "evidence": "familiarity with UI frameworks like JavaFX or Swing"}, {"skill": "Swing", "evidence": "familiarity with UI frameworks like JavaFX or Swing"}, {"skill": "Security Protocols", "evidence": "knowledge of security protocols such as SSL and cryptographic key management"}, {"skill": "Continuous Integration", "evidence": "experience with continuous integration and delivery"}], "notes": ""}
{"id": "jd_048", "source_url": "https://lemon.io/remote-job-descriptions/node-js-developer/", "role_title": "Node.js Developer", "jd_text": "Building server‑side applications using Node.js and creating efficient, secure and scalable code. Enhancing application performance and integrating with services and APIs. Collaborating with cross‑functional teams and setting up applications on cloud platforms with secure networking configurations. Conducting code reviews, writing tests and participating in agile development. Requirements include strong proficiency in JavaScript, experience in Node.js development, experience developing enterprise‑level projects, proficiency with Node.js and frameworks like Express or StrongLoop, understanding of asynchronous programming and event‑driven architecture, knowledge of cloud platforms such as AWS or Azure, understanding of server‑side CSS preprocessors, experience with Docker, familiarity with relational and NoSQL databases, understanding of RESTful API design, knowledge of testing frameworks such as Jest or Mocha, experience with Git and understanding of agile methodologies【225684373035220†L169-L185】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "JavaScript", "evidence": "strong proficiency in JavaScript"}, {"skill": "Node.js", "evidence": "experience in Node.js development"}, {"skill": "Express", "evidence": "proficiency with Node.js and frameworks like Express or StrongLoop"}, {"skill": "StrongLoop", "evidence": "proficiency with Node.js and frameworks like Express or StrongLoop"}, {"skill": "Asynchronous Programming", "evidence": "understanding of asynchronous programming and event‑driven architecture"}, {"skill": "AWS", "evidence": "knowledge of cloud platforms such as AWS or Azure"}, {"skill": "Azure", "evidence": "knowledge of cloud platforms such as AWS or Azure"}, {"skill": "CSS Preprocessors", "evidence": "understanding of server‑side CSS preprocessors"}, {"skill": "Docker", "evidence": "experience with Docker"}, {"skill": "Relational Databases", "evidence": "familiarity with relational and NoSQL databases"}, {"skill": "NoSQL Databases", "evidence": "familiarity with relational and NoSQL databases"}, {"skill": "RESTful API", "evidence": "understanding of RESTful API design"}, {"skill": "Jest", "evidence": "knowledge of testing frameworks such as Jest or Mocha"}, {"skill": "Mocha", "evidence": "knowledge of testing frameworks such as Jest or Mocha"}, {"skill": "Git", "evidence": "experience with Git"}], "notes": ""}
{"id": "jd_049", "source_url": "https://lemon.io/remote-job-descriptions/angular-developer/", "role_title": "Angular Developer", "jd_text": "Creating scalable web applications using Angular and writing clean, maintainable code. Developing compatible databases and APIs and improving application performance. Implementing new technologies and collaborating with cross‑functional teams. Running tests, conducting code reviews and participating in agile development. Requirements include experience with Angular, strong knowledge of JavaScript, proficiency with HTML and CSS, familiarity with TypeScript, knowledge of RESTful services and responsive design principles, experience with frameworks such as Bootstrap or Material Design, experience with build tools like Grunt or Gulp, ability to use testing frameworks, strong communication and problem‑solving skills and proficiency in English【326602574310132†L166-L179】.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "Angular", "evidence": "experience with Angular"}, {"skill": "JavaScript", "evidence": "strong knowledge of JavaScript"}, {"skill": "HTML", "evidence": "proficiency with HTML and CSS"}, {"skill": "CSS", "evidence": "proficiency with HTML and CSS"}, {"skill": "TypeScript", "evidence": "familiarity with TypeScript"}, {"skill": "RESTful Services", "evidence": "knowledge of RESTful services"}, {"skill": "Responsive Design", "evidence": "responsive design"}, {"skill": "Bootstrap", "evidence": "experience with frameworks such as Bootstrap or Material Design"}, {"skill": "Material Design", "evidence": "experience with frameworks such as Bootstrap or Material Design"}, {"skill": "Build Tools", "evidence": "experience with build tools like Grunt or Gulp"}, {"skill": "Testing Frameworks", "evidence": "ability to use testing frameworks"}], "notes": ""}
{"id": "jd_050", "source_url": "https://lemon.io/remote-job-descriptions/back-end-developer/", "role_title": "Cloud Engineer (duplicate handled)", "jd_text": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud. Optimizing infrastructure for performance, security and cost. Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning. Writing scripts in Python, Go or Bash and implementing Infrastructure as Code. Monitoring infrastructure and integrating third‑party services. Ensuring security best practices and participating in agile development processes. Requirements include experience with cloud platforms, orchestration tools, scripting languages, Infrastructure as Code, monitoring and integration, strong problem‑solving skills and communication abilities and proficiency in English.", "expected_intent": "INGEST_JD", "expected_skills": [{"skill": "AWS", "evidence": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud"}, {"skill": "Azure", "evidence": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud"}, {"skill": "Google Cloud", "evidence": "Designing and managing cloud infrastructure across AWS, Azure and Google Cloud"}, {"skill": "Terraform", "evidence": "Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning"}, {"skill": "Kubernetes", "evidence": "Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning"}, {"skill": "CloudFormation", "evidence": "Using orchestration tools such as Terraform, Kubernetes and CloudFormation to automate provisioning"}, {"skill": "Python", "evidence": "Writing scripts in Python, Go or Bash"}, {"skill": "Go", "evidence": "Writing scripts in Python, Go or Bash"}, {"skill": "Bash", "evidence": "Writing scripts in Python, Go or Bash"}, {"skill": "Infrastructure as Code", "evidence": "implementing Infrastructure as Code"}, {"skill": "Monitoring", "evidence": "Monitoring infrastructure and integrating third‑party services"}, {"skill": "Security Best Practices", "evidence": "Ensuring security best practices"}], "notes": ""}
